{"dependencias":["6",2,"7",0,"8",0,"9",0,"10",0,"11",2,"12",0,"13",0,"14",0,"15",2,"16",0,"17",0,"18",2,"19",0,"20",0,"21",0,"22",2,"23",0],"atividades":[{"id":1,"codigo":"1","titulo":"Abertura","contexto":[" eu sou RoboEdu e esta aula é baseada em PBL, Ensino Baseado em Problemas (EBP)."," eu sou RoboEdu e esta aula tem base nos conceitos de PBL."],"atividades":["2"],"textoEsperado":[""],"links":null},{"id":2,"codigo":"1","titulo":"Explicação inicial","contexto":[" eu sou RoboEdu, seu tutor virtual."," eu sou RoboEdu e estou aqui para guiá-lo."],"atividades":["3"],"textoEsperado":[""],"links":null},{"id":3,"codigo":"3","titulo":"Problemática","contexto":["O problema para ser resolvido nesta aula é construir um jogo no estilo Arkanoid utilizando a ferramenta Construct.","O problema que proponho que vc resolva é construir um jogo no estilo Arkanoid utilizando a ferramenta Construct. Aproveite e pesquise algo sobre a ferramenta proposta.","O problema para ser resolvido nesta aula é construir um jogo no estilo Arkanoid utilizando a ferramenta Construct. Aproveite e pesquise algo sobre a ferramenta proposta."],"atividades":["4","5"],"textoEsperado":["SIM"],"links":null},{"id":4,"codigo":"5","titulo":"Vídeo sobre o que é o jogo Arkanoid","contexto":["Eu abri um vídeo ao lado sobre como é um jogo Arkanoid. Sinta-se à avontade para reiniciar o vídeo quantas vezes quiser.","Eu carreguei e abri um vídeo sobre o jogo Arkanoid para vc se familiarizar com ele.","Abri um vídeo sobre o jogo Arkanoid."],"atividades":["5"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaArkanoid\/0.mp4",""]},{"id":5,"codigo":"6","titulo":"Ir para sumário principal","contexto":["Esta aula é dividida em conjuntos de atividades que permitirão que vc progrida na resolução do problema proposto. Sinta-se à avontade para escolher a que vc quiser.","Para esta aula dividi os conteúdos em conjuntos de atividades. Às vezes vou direcionar você para os conteúdos que acho necessários que sejam vistos.","Estou listando um conjunto de atividades para você adquirir conhecimentos básicos para resolver o problema proposto."],"atividades":["6","11","15","18","22"],"textoEsperado":[""],"links":null},{"id":6,"codigo":"6","titulo":"Montar cenário","contexto":["Mais ferramentas do Construct? Aqui você aprenderá os conceitos básicos sobre Montar cenário. Lembre-se que a primeira opção volta para o sumário principal.","Você quer saber como Montar cenário no Construct não é? Aqui você aprenderá como Montar cenário para o jogo Arkanoid.","Aqui você aprenderá como Montar cenário para seu jogo Arkanoid."],"atividades":["5","7","8","9","10"],"textoEsperado":[""],"links":null},{"id":7,"codigo":"5","titulo":"Tiled background","contexto":["Um vídeo foi aberto sobre o tema Tiled background.","Eu carreguei um vídeo sobre o tema Tiled background.","Encontrei um vídeo sobre Tiled background em meu banco de dados, estou carregando ele para você =D."],"atividades":["6"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaArkanoid\/1.mp4",""]},{"id":8,"codigo":"5","titulo":"Sprite","contexto":["Um vídeo foi aberto sobre o tema Sprite.","Eu carreguei um vídeo sobre o tema Sprite.","Encontrei um vídeo sobre Sprite em meu banco de dados, estou carregando ele para você =D."],"atividades":["6"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaArkanoid\/2.mp4",""]},{"id":9,"codigo":"5","titulo":"Grade e copiar objetos","contexto":["Um vídeo foi aberto sobre o tema Grade e copiar objetos.","Eu carreguei um vídeo sobre o tema Grade e copiar objetos.","Encontrei um vídeo sobre Grade e copiar objetos em meu banco de dados, estou carregando ele para você =D."],"atividades":["6"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaArkanoid\/3.mp4",""]},{"id":10,"codigo":"5","titulo":"Text","contexto":["Um vídeo foi aberto sobre o tema Text.","Eu carreguei um vídeo sobre o tema Text.","Encontrei um vídeo sobre Text em meu banco de dados, estou carregando ele para você =D."],"atividades":["6"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaArkanoid\/4.mp4",""]},{"id":11,"codigo":"6","titulo":"Movimentar a barra","contexto":["Mais ferramentas do Construct? Aqui você aprenderá os conceitos básicos sobre Movimentar a barra. Lembre-se que a primeira opção volta para o sumário principal.","Você quer saber como Movimentar a barra no Construct não é? Aqui você aprenderá como Movimentar a barra para o jogo Arkanoid.","Aqui você aprenderá como Movimentar a barra para seu jogo Arkanoid."],"atividades":["5","12","13","14"],"textoEsperado":[""],"links":null},{"id":12,"codigo":"5","titulo":"8Direction","contexto":["Um vídeo foi aberto sobre o tema 8Direction.","Eu carreguei um vídeo sobre o tema 8Direction.","Encontrei um vídeo sobre 8Direction em meu banco de dados, estou carregando ele para você =D."],"atividades":["11"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaArkanoid\/5.mp4",""]},{"id":13,"codigo":"5","titulo":"Bound to layout","contexto":["Um vídeo foi aberto sobre o tema Bound to layout.","Eu carreguei um vídeo sobre o tema Bound to layout.","Encontrei um vídeo sobre Bound to layout em meu banco de dados, estou carregando ele para você =D."],"atividades":["11"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaArkanoid\/6.mp4",""]},{"id":14,"codigo":"5","titulo":"Solid","contexto":["Um vídeo foi aberto sobre o tema Solid.","Eu carreguei um vídeo sobre o tema Solid.","Encontrei um vídeo sobre Solid em meu banco de dados, estou carregando ele para você =D."],"atividades":["11"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaArkanoid\/7.mp4",""]},{"id":15,"codigo":"6","titulo":"Movimentar a bola","contexto":["Mais ferramentas do Construct? Aqui você aprenderá os conceitos básicos sobre Movimentar a bola. Lembre-se que a primeira opção volta para o sumário principal.","Você quer saber como Movimentar a bola no Construct não é? Aqui você aprenderá como Movimentar a bola para o jogo Arkanoid.","Aqui você aprenderá como Movimentar a bola para seu jogo Arkanoid."],"atividades":["5","16","17"],"textoEsperado":[""],"links":null},{"id":16,"codigo":"5","titulo":"Bullet","contexto":["Um vídeo foi aberto sobre o tema Bullet.","Eu carreguei um vídeo sobre o tema Bullet.","Encontrei um vídeo sobre Bullet em meu banco de dados, estou carregando ele para você =D."],"atividades":["15"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaArkanoid\/8.mp4",""]},{"id":17,"codigo":"5","titulo":"Keyboard","contexto":["Um vídeo foi aberto sobre o tema Keyboard.","Eu carreguei um vídeo sobre o tema Keyboard.","Encontrei um vídeo sobre Keyboard em meu banco de dados, estou carregando ele para você =D."],"atividades":["15"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaArkanoid\/9.mp4",""]},{"id":18,"codigo":"6","titulo":"Criar sistema de pontuação","contexto":["Mais ferramentas do Construct? Aqui você aprenderá os conceitos básicos sobre Criar sistema de pontuação. Lembre-se que a primeira opção volta para o sumário principal.","Você quer saber como Criar sistema de pontuação no Construct não é? Aqui você aprenderá como Criar sistema de pontuação para o jogo Arkanoid.","Aqui você aprenderá como Criar sistema de pontuação para seu jogo Arkanoid."],"atividades":["5","19","20","21"],"textoEsperado":[""],"links":null},{"id":19,"codigo":"5","titulo":"Variáveis","contexto":["Um vídeo foi aberto sobre o tema Variáveis.","Eu carreguei um vídeo sobre o tema Variáveis.","Encontrei um vídeo sobre Variáveis em meu banco de dados, estou carregando ele para você =D."],"atividades":["18"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaArkanoid\/10.mp4",""]},{"id":20,"codigo":"5","titulo":"Colisão entre objetos","contexto":["Um vídeo foi aberto sobre o tema Colisão entre objetos.","Eu carreguei um vídeo sobre o tema Colisão entre objetos.","Encontrei um vídeo sobre Colisão entre objetos em meu banco de dados, estou carregando ele para você =D."],"atividades":["18"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaArkanoid\/11.mp4",""]},{"id":21,"codigo":"5","titulo":"Pontuação","contexto":["Um vídeo foi aberto sobre o tema Pontuação.","Eu carreguei um vídeo sobre o tema Pontuação.","Encontrei um vídeo sobre Pontuação em meu banco de dados, estou carregando ele para você =D."],"atividades":["18"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaArkanoid\/12.mp4",""]},{"id":22,"codigo":"6","titulo":"Sistema de derrota e vitória","contexto":["Mais ferramentas do Construct? Aqui você aprenderá os conceitos básicos sobre Sistema de derrota e vitória. Lembre-se que a primeira opção volta para o sumário principal.","Você quer saber como Sistema de derrota e vitória no Construct não é? Aqui você aprenderá como Sistema de derrota e vitória para o jogo Arkanoid.","Aqui você aprenderá como Sistema de derrota e vitória para seu jogo Arkanoid."],"atividades":["5","23"],"textoEsperado":[""],"links":null},{"id":23,"codigo":"5","titulo":"Restart layout","contexto":["Um vídeo foi aberto sobre o tema Restart layout.","Eu carreguei um vídeo sobre o tema Restart layout.","Encontrei um vídeo sobre Restart layout em meu banco de dados, estou carregando ele para você =D."],"atividades":["22"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaArkanoid\/13.mp4",""]}]}