{"dependencias":[],"atividades":[{"id":1,"codigo":"1","titulo":"Abertura","contexto":[" eu sou RoboEdu e esta aula é baseada em PBL, Ensino Baseado em Problemas (EBP)."," eu sou RoboEdu e esta aula tem base nos conceitos de PBL."],"atividades":["2"],"textoEsperado":[""],"links":null},{"id":2,"codigo":"1","titulo":"Explicação inicial","contexto":[" eu sou RoboEdu, seu tutor virtual."," eu sou RoboEdu e estou aqui para guiá-lo."],"atividades":["3"],"textoEsperado":[""],"links":null},{"id":3,"codigo":"3","titulo":"Problemática","contexto":["O problema para ser resolvido nesta aula é construir um jogo no estilo Arkanoid utilizando a ferramenta Construct.","O problema que proponho que vc resolva é construir um jogo no estilo Arkanoid utilizando a ferramenta Construct. Aproveite e pesquise algo sobre a ferramenta proposta.","O problema para ser resolvido nesta aula é construir um jogo no estilo Arkanoid utilizando a ferramenta Construct. Aproveite e pesquise algo sobre a ferramenta proposta."],"atividades":["4","5"],"textoEsperado":["SIM"],"links":null},{"id":4,"codigo":"5","titulo":"Vídeo sobre o que é o jogo Arkanoid","contexto":["Eu abri um vídeo ao lado sobre como é um jogo Arkanoid. Sinta-se à avontade para reiniciar o vídeo quantas vezes quiser.","Eu carreguei e abri um vídeo sobre o jogo Arkanoid para vc se familiarizar com ele.","Abri um vídeo sobre o jogo Arkanoid."],"atividades":["5"],"textoEsperado":[""],"links":["",""]},{"id":5,"codigo":"6","titulo":"Ir para sumário principal","contexto":["Esta aula é dividida em conjuntos de atividades que permitirão que vc progrida na resolução do problema proposto. Sinta-se à avontade para escolher a que vc quiser.","Para esta aula dividi os conteúdos em conjuntos de atividades. Às vezes vou direcionar você para os conteúdos que acho necessários que sejam vistos.","Estou listando um conjunto de atividades para você adquirir conhecimentos básicos para resolver o problema proposto."],"atividades":null,"textoEsperado":[""],"links":null}]}