{"dependencias":["6",2,"7",0,"8",0,"9",0,"10",2,"11",0,"12",0,"13",0,"14",0,"15",2,"16",0,"17",0,"18",0,"19",2,"20",0,"21",0],"atividades":[{"id":1,"codigo":"1","titulo":"Abertura","contexto":[" eu sou RoboEdu e esta aula é baseada em PBL, Ensino Baseado em Problemas (EBP)."," eu sou RoboEdu e esta aula tem base nos conceitos de PBL."],"atividades":["2"],"textoEsperado":[""],"links":null},{"id":2,"codigo":"1","titulo":"Explicação inicial","contexto":[" eu sou RoboEdu, seu tutor virtual."," eu sou RoboEdu e estou aqui para guiá-lo."],"atividades":["3"],"textoEsperado":[""],"links":null},{"id":3,"codigo":"3","titulo":"Problemática","contexto":["O problema para ser resolvido nesta aula é construir um jogo no estilo Primeiro jogo utilizando a ferramenta Construct.","O problema que proponho que vc resolva é construir um jogo no estilo Primeiro jogo utilizando a ferramenta Construct. Aproveite e pesquise algo sobre a ferramenta proposta.","O problema para ser resolvido nesta aula é construir um jogo no estilo Primeiro jogo utilizando a ferramenta Construct. Aproveite e pesquise algo sobre a ferramenta proposta."],"atividades":["4","5"],"textoEsperado":["SIM"],"links":null},{"id":4,"codigo":"5","titulo":"Vídeo sobre o que é o jogo Primeiro jogo","contexto":["Eu abri um vídeo ao lado sobre como é um jogo Primeiro jogo. Sinta-se à avontade para reiniciar o vídeo quantas vezes quiser.","Eu carreguei e abri um vídeo sobre o jogo Primeiro jogo para vc se familiarizar com ele.","Abri um vídeo sobre o jogo Primeiro jogo."],"atividades":["5"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaIntroducao\/0.mp4",""]},{"id":5,"codigo":"6","titulo":"Ir para sumário principal","contexto":["Esta aula é dividida em conjuntos de atividades que permitirão que vc progrida na resolução do problema proposto. Sinta-se à avontade para escolher a que vc quiser.","Para esta aula dividi os conteúdos em conjuntos de atividades. Às vezes vou direcionar você para os conteúdos que acho necessários que sejam vistos.","Estou listando um conjunto de atividades para você adquirir conhecimentos básicos para resolver o problema proposto."],"atividades":["6","10","15","19"],"textoEsperado":[""],"links":null},{"id":6,"codigo":"6","titulo":"Realizar configurações básicas","contexto":["Mais ferramentas do Construct? Aqui você aprenderá os conceitos básicos sobre Realizar configurações básicas. Lembre-se que a primeira opção volta para o sumário principal.","Você quer saber como Realizar configurações básicas no Construct não é? Aqui você aprenderá como Realizar configurações básicas para o jogo Arkanoid.","Aqui você aprenderá como Realizar configurações básicas para seu jogo Arkanoid."],"atividades":["5","7","8","9"],"textoEsperado":[""],"links":null},{"id":7,"codigo":"5","titulo":"Download e instalação","contexto":["Um vídeo foi aberto sobre o tema Download e instalação.","Eu carreguei um vídeo sobre o tema Download e instalação.","Encontrei um vídeo sobre Download e instalação em meu banco de dados, estou carregando ele para você =D."],"atividades":["6"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaIntroducao\/1.mp4",""]},{"id":8,"codigo":"5","titulo":"Criar projeto","contexto":["Um vídeo foi aberto sobre o tema Criar projeto.","Eu carreguei um vídeo sobre o tema Criar projeto.","Encontrei um vídeo sobre Criar projeto em meu banco de dados, estou carregando ele para você =D."],"atividades":["6"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaIntroducao\/2.mp4",""]},{"id":9,"codigo":"5","titulo":"Configuração do layout","contexto":["Um vídeo foi aberto sobre o tema Configuração do layout.","Eu carreguei um vídeo sobre o tema Configuração do layout.","Encontrei um vídeo sobre Configuração do layout em meu banco de dados, estou carregando ele para você =D."],"atividades":["6"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaIntroducao\/3.mp4",""]},{"id":10,"codigo":"6","titulo":"Inserir objetos no cenário","contexto":["Mais ferramentas do Construct? Aqui você aprenderá os conceitos básicos sobre Inserir objetos no cenário. Lembre-se que a primeira opção volta para o sumário principal.","Você quer saber como Inserir objetos no cenário no Construct não é? Aqui você aprenderá como Inserir objetos no cenário para o jogo Arkanoid.","Aqui você aprenderá como Inserir objetos no cenário para seu jogo Arkanoid."],"atividades":["5","11","12","13","14"],"textoEsperado":[""],"links":null},{"id":11,"codigo":"5","titulo":"Tiled background","contexto":["Um vídeo foi aberto sobre o tema Tiled background.","Eu carreguei um vídeo sobre o tema Tiled background.","Encontrei um vídeo sobre Tiled background em meu banco de dados, estou carregando ele para você =D."],"atividades":["10"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaIntroducao\/4.mp4",""]},{"id":12,"codigo":"5","titulo":"Sprite","contexto":["Um vídeo foi aberto sobre o tema Sprite.","Eu carreguei um vídeo sobre o tema Sprite.","Encontrei um vídeo sobre Sprite em meu banco de dados, estou carregando ele para você =D."],"atividades":["10"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaIntroducao\/5.mp4",""]},{"id":13,"codigo":"5","titulo":"Text","contexto":["Um vídeo foi aberto sobre o tema Text.","Eu carreguei um vídeo sobre o tema Text.","Encontrei um vídeo sobre Text em meu banco de dados, estou carregando ele para você =D."],"atividades":["10"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaIntroducao\/6.mp4",""]},{"id":14,"codigo":"5","titulo":"Keyboard e Mouse","contexto":["Um vídeo foi aberto sobre o tema Keyboard e Mouse.","Eu carreguei um vídeo sobre o tema Keyboard e Mouse.","Encontrei um vídeo sobre Keyboard e Mouse em meu banco de dados, estou carregando ele para você =D."],"atividades":["10"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaIntroducao\/7.mp4",""]},{"id":15,"codigo":"6","titulo":"Inserir Behaviors em objetos","contexto":["Mais ferramentas do Construct? Aqui você aprenderá os conceitos básicos sobre Inserir Behaviors em objetos. Lembre-se que a primeira opção volta para o sumário principal.","Você quer saber como Inserir Behaviors em objetos no Construct não é? Aqui você aprenderá como Inserir Behaviors em objetos para o jogo Arkanoid.","Aqui você aprenderá como Inserir Behaviors em objetos para seu jogo Arkanoid."],"atividades":["5","16","17","18"],"textoEsperado":[""],"links":null},{"id":16,"codigo":"5","titulo":"8 Directions","contexto":["Um vídeo foi aberto sobre o tema 8 Directions.","Eu carreguei um vídeo sobre o tema 8 Directions.","Encontrei um vídeo sobre 8 Directions em meu banco de dados, estou carregando ele para você =D."],"atividades":["15"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaIntroducao\/8.mp4",""]},{"id":17,"codigo":"5","titulo":"Bound to layout e Scroll to","contexto":["Um vídeo foi aberto sobre o tema Bound to layout e Scroll to.","Eu carreguei um vídeo sobre o tema Bound to layout e Scroll to.","Encontrei um vídeo sobre Bound to layout e Scroll to em meu banco de dados, estou carregando ele para você =D."],"atividades":["15"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaIntroducao\/9.mp4",""]},{"id":18,"codigo":"5","titulo":"Solid e bullet","contexto":["Um vídeo foi aberto sobre o tema Solid e bullet.","Eu carreguei um vídeo sobre o tema Solid e bullet.","Encontrei um vídeo sobre Solid e bullet em meu banco de dados, estou carregando ele para você =D."],"atividades":["15"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaIntroducao\/10.mp4",""]},{"id":19,"codigo":"6","titulo":"Usar o Event sheet","contexto":["Mais ferramentas do Construct? Aqui você aprenderá os conceitos básicos sobre Usar o Event sheet. Lembre-se que a primeira opção volta para o sumário principal.","Você quer saber como Usar o Event sheet no Construct não é? Aqui você aprenderá como Usar o Event sheet para o jogo Arkanoid.","Aqui você aprenderá como Usar o Event sheet para seu jogo Arkanoid."],"atividades":["5","20","21"],"textoEsperado":[""],"links":null},{"id":20,"codigo":"5","titulo":"Executando tudo","contexto":["Um vídeo foi aberto sobre o tema Executando tudo.","Eu carreguei um vídeo sobre o tema Executando tudo.","Encontrei um vídeo sobre Executando tudo em meu banco de dados, estou carregando ele para você =D."],"atividades":["19"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaIntroducao\/11.mp4",""]},{"id":21,"codigo":"5","titulo":"Conclusão","contexto":["Um vídeo foi aberto sobre o tema Conclusão.","Eu carreguei um vídeo sobre o tema Conclusão.","Encontrei um vídeo sobre Conclusão em meu banco de dados, estou carregando ele para você =D."],"atividades":["19"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaIntroducao\/12.mp4",""]}]}