{"dependencias":["6",2,"7",0,"8",0,"9",0,"10",0,"11",2,"12",0,"13",0,"14",2,"15",0,"16",0,"17",2,"18",0,"19",2,"20",0,"21",0,"22",0,"23",0],"atividades":[{"id":1,"codigo":"1","titulo":"Abertura","contexto":[" eu sou RoboEdu e esta aula é baseada em PBL, Ensino Baseado em Problemas (EBP)."," eu sou RoboEdu e esta aula tem base nos conceitos de PBL."],"atividades":["2"],"textoEsperado":[""],"links":null},{"id":2,"codigo":"1","titulo":"Explicação inicial","contexto":[" eu sou RoboEdu, seu tutor virtual."," eu sou RoboEdu e estou aqui para guiá-lo."],"atividades":["3"],"textoEsperado":[""],"links":null},{"id":3,"codigo":"3","titulo":"Problemática","contexto":["O problema para ser resolvido nesta aula é construir um jogo no estilo Invasão periódica utilizando a ferramenta Construct.","O problema que proponho que vc resolva é construir um jogo no estilo Invasão periódica utilizando a ferramenta Construct. Aproveite e pesquise algo sobre a ferramenta proposta.","O problema para ser resolvido nesta aula é construir um jogo no estilo Invasão periódica utilizando a ferramenta Construct. Aproveite e pesquise algo sobre a ferramenta proposta."],"atividades":["4","5"],"textoEsperado":["SIM"],"links":null},{"id":4,"codigo":"5","titulo":"Vídeo sobre o que é o jogo Invasão periódica","contexto":["Eu abri um vídeo ao lado sobre como é um jogo Invasão periódica. Sinta-se à avontade para reiniciar o vídeo quantas vezes quiser.","Eu carreguei e abri um vídeo sobre o jogo Invasão periódica para vc se familiarizar com ele.","Abri um vídeo sobre o jogo Invasão periódica."],"atividades":["5"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaInvasaoPeriodica\/0.mp4",""]},{"id":5,"codigo":"6","titulo":"Ir para sumário principal","contexto":["Esta aula é dividida em conjuntos de atividades que permitirão que vc progrida na resolução do problema proposto. Sinta-se à avontade para escolher a que vc quiser.","Para esta aula dividi os conteúdos em conjuntos de atividades. Às vezes vou direcionar você para os conteúdos que acho necessários que sejam vistos.","Estou listando um conjunto de atividades para você adquirir conhecimentos básicos para resolver o problema proposto."],"atividades":["6","11","14","17","19"],"textoEsperado":[""],"links":null},{"id":6,"codigo":"6","titulo":"Configurar a abertura do jogo","contexto":["Mais ferramentas do Construct? Aqui você aprenderá os conceitos básicos sobre Configurar a abertura do jogo. Lembre-se que a primeira opção volta para o sumário principal.","Você quer saber como Configurar a abertura do jogo no Construct não é? Aqui você aprenderá como Configurar a abertura do jogo para o jogo Arkanoid.","Aqui você aprenderá como Configurar a abertura do jogo para seu jogo Arkanoid."],"atividades":["5","7","8","9","10"],"textoEsperado":[""],"links":null},{"id":7,"codigo":"5","titulo":"Configurando o layout","contexto":["Um vídeo foi aberto sobre o tema Configurando o layout.","Eu carreguei um vídeo sobre o tema Configurando o layout.","Encontrei um vídeo sobre Configurando o layout em meu banco de dados, estou carregando ele para você =D."],"atividades":["6"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaInvasaoPeriodica\/1.mp4",""]},{"id":8,"codigo":"5","titulo":"Background","contexto":["Um vídeo foi aberto sobre o tema Background.","Eu carreguei um vídeo sobre o tema Background.","Encontrei um vídeo sobre Background em meu banco de dados, estou carregando ele para você =D."],"atividades":["6"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaInvasaoPeriodica\/2.mp4",""]},{"id":9,"codigo":"5","titulo":"Sprites","contexto":["Um vídeo foi aberto sobre o tema Sprites.","Eu carreguei um vídeo sobre o tema Sprites.","Encontrei um vídeo sobre Sprites em meu banco de dados, estou carregando ele para você =D."],"atividades":["6"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaInvasaoPeriodica\/3.mp4",""]},{"id":10,"codigo":"5","titulo":"Text e mouse","contexto":["Um vídeo foi aberto sobre o tema Text e mouse.","Eu carreguei um vídeo sobre o tema Text e mouse.","Encontrei um vídeo sobre Text e mouse em meu banco de dados, estou carregando ele para você =D."],"atividades":["6"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaInvasaoPeriodica\/4.mp4",""]},{"id":11,"codigo":"6","titulo":"Criar cenários","contexto":["Mais ferramentas do Construct? Aqui você aprenderá os conceitos básicos sobre Criar cenários. Lembre-se que a primeira opção volta para o sumário principal.","Você quer saber como Criar cenários no Construct não é? Aqui você aprenderá como Criar cenários para o jogo Arkanoid.","Aqui você aprenderá como Criar cenários para seu jogo Arkanoid."],"atividades":["5","12","13"],"textoEsperado":[""],"links":null},{"id":12,"codigo":"5","titulo":"Ir para tela de missão","contexto":["Um vídeo foi aberto sobre o tema Ir para tela de missão.","Eu carreguei um vídeo sobre o tema Ir para tela de missão.","Encontrei um vídeo sobre Ir para tela de missão em meu banco de dados, estou carregando ele para você =D."],"atividades":["11"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaInvasaoPeriodica\/5.mp4",""]},{"id":13,"codigo":"5","titulo":"Configurando cenário e inserindo objetos","contexto":["Um vídeo foi aberto sobre o tema Configurando cenário e inserindo objetos.","Eu carreguei um vídeo sobre o tema Configurando cenário e inserindo objetos.","Encontrei um vídeo sobre Configurando cenário e inserindo objetos em meu banco de dados, estou carregando ele para você =D."],"atividades":["11"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaInvasaoPeriodica\/6.mp4",""]},{"id":14,"codigo":"6","titulo":"Criar o player","contexto":["Mais ferramentas do Construct? Aqui você aprenderá os conceitos básicos sobre Criar o player. Lembre-se que a primeira opção volta para o sumário principal.","Você quer saber como Criar o player no Construct não é? Aqui você aprenderá como Criar o player para o jogo Arkanoid.","Aqui você aprenderá como Criar o player para seu jogo Arkanoid."],"atividades":["5","15","16"],"textoEsperado":[""],"links":null},{"id":15,"codigo":"5","titulo":"Inserir o personagem","contexto":["Um vídeo foi aberto sobre o tema Inserir o personagem.","Eu carreguei um vídeo sobre o tema Inserir o personagem.","Encontrei um vídeo sobre Inserir o personagem em meu banco de dados, estou carregando ele para você =D."],"atividades":["14"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaInvasaoPeriodica\/7.mp4",""]},{"id":16,"codigo":"5","titulo":"O tiro da nave","contexto":["Um vídeo foi aberto sobre o tema O tiro da nave.","Eu carreguei um vídeo sobre o tema O tiro da nave.","Encontrei um vídeo sobre O tiro da nave em meu banco de dados, estou carregando ele para você =D."],"atividades":["14"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaInvasaoPeriodica\/8.mp4",""]},{"id":17,"codigo":"6","titulo":"Os elementos químicos","contexto":["Mais ferramentas do Construct? Aqui você aprenderá os conceitos básicos sobre Os elementos químicos. Lembre-se que a primeira opção volta para o sumário principal.","Você quer saber como Os elementos químicos no Construct não é? Aqui você aprenderá como Os elementos químicos para o jogo Arkanoid.","Aqui você aprenderá como Os elementos químicos para seu jogo Arkanoid."],"atividades":["5","18"],"textoEsperado":[""],"links":null},{"id":18,"codigo":"5","titulo":"Inserindo os elementos","contexto":["Um vídeo foi aberto sobre o tema Inserindo os elementos.","Eu carreguei um vídeo sobre o tema Inserindo os elementos.","Encontrei um vídeo sobre Inserindo os elementos em meu banco de dados, estou carregando ele para você =D."],"atividades":["17"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaInvasaoPeriodica\/9.mp4",""]},{"id":19,"codigo":"6","titulo":"Dar vida ao jogo","contexto":["Mais ferramentas do Construct? Aqui você aprenderá os conceitos básicos sobre Dar vida ao jogo. Lembre-se que a primeira opção volta para o sumário principal.","Você quer saber como Dar vida ao jogo no Construct não é? Aqui você aprenderá como Dar vida ao jogo para o jogo Arkanoid.","Aqui você aprenderá como Dar vida ao jogo para seu jogo Arkanoid."],"atividades":["5","20","21","22","23"],"textoEsperado":[""],"links":null},{"id":20,"codigo":"5","titulo":"Atirando com a nave","contexto":["Um vídeo foi aberto sobre o tema Atirando com a nave.","Eu carreguei um vídeo sobre o tema Atirando com a nave.","Encontrei um vídeo sobre Atirando com a nave em meu banco de dados, estou carregando ele para você =D."],"atividades":["19"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaInvasaoPeriodica\/10.mp4",""]},{"id":21,"codigo":"5","titulo":"E surgem os elementos","contexto":["Um vídeo foi aberto sobre o tema E surgem os elementos.","Eu carreguei um vídeo sobre o tema E surgem os elementos.","Encontrei um vídeo sobre E surgem os elementos em meu banco de dados, estou carregando ele para você =D."],"atividades":["19"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaInvasaoPeriodica\/11.mp4",""]},{"id":22,"codigo":"5","titulo":"Destruição de objetos e pontuação","contexto":["Um vídeo foi aberto sobre o tema Destruição de objetos e pontuação.","Eu carreguei um vídeo sobre o tema Destruição de objetos e pontuação.","Encontrei um vídeo sobre Destruição de objetos e pontuação em meu banco de dados, estou carregando ele para você =D."],"atividades":["19"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaInvasaoPeriodica\/12.mp4",""]},{"id":23,"codigo":"5","titulo":"Como perder e ganhar no jogo","contexto":["Um vídeo foi aberto sobre o tema Como perder e ganhar no jogo.","Eu carreguei um vídeo sobre o tema Como perder e ganhar no jogo.","Encontrei um vídeo sobre Como perder e ganhar no jogo em meu banco de dados, estou carregando ele para você =D."],"atividades":["19"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaInvasaoPeriodica\/13.mp4",""]}]}