{"dependencias":["6",2,"7",0,"8",0,"9",0,"10",2,"11",0,"12",0,"13",2,"14",0,"15",0,"16",2,"17",0,"18",0,"19",0,"20",2,"21",0,"22",0,"23",2,"24",0],"atividades":[{"id":1,"codigo":"1","titulo":"Abertura","contexto":[" eu sou RoboEdu e esta aula é baseada em PBL, Ensino Baseado em Problemas (EBP)."," eu sou RoboEdu e esta aula tem base nos conceitos de PBL."],"atividades":["2"],"textoEsperado":[""],"links":null},{"id":2,"codigo":"1","titulo":"Explicação inicial","contexto":[" eu sou RoboEdu, seu tutor virtual."," eu sou RoboEdu e estou aqui para guiá-lo."],"atividades":["3"],"textoEsperado":[""],"links":null},{"id":3,"codigo":"3","titulo":"Problemática","contexto":["O problema para ser resolvido nesta aula é construir um jogo no estilo Nave utilizando a ferramenta Construct.","O problema que proponho que vc resolva é construir um jogo no estilo Nave utilizando a ferramenta Construct. Aproveite e pesquise algo sobre a ferramenta proposta.","O problema para ser resolvido nesta aula é construir um jogo no estilo Nave utilizando a ferramenta Construct. Aproveite e pesquise algo sobre a ferramenta proposta."],"atividades":["4","5"],"textoEsperado":["SIM"],"links":null},{"id":4,"codigo":"5","titulo":"Vídeo sobre o que é o jogo Nave","contexto":["Eu abri um vídeo ao lado sobre como é um jogo Nave. Sinta-se à avontade para reiniciar o vídeo quantas vezes quiser.","Eu carreguei e abri um vídeo sobre o jogo Nave para vc se familiarizar com ele.","Abri um vídeo sobre o jogo Nave."],"atividades":["5"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaNave\/0.mp4",""]},{"id":5,"codigo":"6","titulo":"Ir para sumário principal","contexto":["Esta aula é dividida em conjuntos de atividades que permitirão que vc progrida na resolução do problema proposto. Sinta-se à avontade para escolher a que vc quiser.","Para esta aula dividi os conteúdos em conjuntos de atividades. Às vezes vou direcionar você para os conteúdos que acho necessários que sejam vistos.","Estou listando um conjunto de atividades para você adquirir conhecimentos básicos para resolver o problema proposto."],"atividades":["6","10","13","16","20","23"],"textoEsperado":[""],"links":null},{"id":6,"codigo":"6","titulo":"Montar cenário","contexto":["Mais ferramentas do Construct? Aqui você aprenderá os conceitos básicos sobre Montar cenário. Lembre-se que a primeira opção volta para o sumário principal.","Você quer saber como Montar cenário no Construct não é? Aqui você aprenderá como Montar cenário para o jogo Arkanoid.","Aqui você aprenderá como Montar cenário para seu jogo Arkanoid."],"atividades":["5","7","8","9"],"textoEsperado":[""],"links":null},{"id":7,"codigo":"5","titulo":"Tiled background","contexto":["Um vídeo foi aberto sobre o tema Tiled background.","Eu carreguei um vídeo sobre o tema Tiled background.","Encontrei um vídeo sobre Tiled background em meu banco de dados, estou carregando ele para você =D."],"atividades":["6"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaNave\/1.mp4",""]},{"id":8,"codigo":"5","titulo":"Sprite","contexto":["Um vídeo foi aberto sobre o tema Sprite.","Eu carreguei um vídeo sobre o tema Sprite.","Encontrei um vídeo sobre Sprite em meu banco de dados, estou carregando ele para você =D."],"atividades":["6"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaNave\/2.mp4",""]},{"id":9,"codigo":"5","titulo":"Text","contexto":["Um vídeo foi aberto sobre o tema Text.","Eu carreguei um vídeo sobre o tema Text.","Encontrei um vídeo sobre Text em meu banco de dados, estou carregando ele para você =D."],"atividades":["6"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaNave\/3.mp4",""]},{"id":10,"codigo":"6","titulo":"Criar o comportamento da nave","contexto":["Mais ferramentas do Construct? Aqui você aprenderá os conceitos básicos sobre Criar o comportamento da nave. Lembre-se que a primeira opção volta para o sumário principal.","Você quer saber como Criar o comportamento da nave no Construct não é? Aqui você aprenderá como Criar o comportamento da nave para o jogo Arkanoid.","Aqui você aprenderá como Criar o comportamento da nave para seu jogo Arkanoid."],"atividades":["5","11","12"],"textoEsperado":[""],"links":null},{"id":11,"codigo":"5","titulo":"8Direction","contexto":["Um vídeo foi aberto sobre o tema 8Direction.","Eu carreguei um vídeo sobre o tema 8Direction.","Encontrei um vídeo sobre 8Direction em meu banco de dados, estou carregando ele para você =D."],"atividades":["10"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaNave\/4.mp4",""]},{"id":12,"codigo":"5","titulo":"Bound to Layout","contexto":["Um vídeo foi aberto sobre o tema Bound to Layout.","Eu carreguei um vídeo sobre o tema Bound to Layout.","Encontrei um vídeo sobre Bound to Layout em meu banco de dados, estou carregando ele para você =D."],"atividades":["10"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaNave\/5.mp4",""]},{"id":13,"codigo":"6","titulo":"Criar os inimigos","contexto":["Mais ferramentas do Construct? Aqui você aprenderá os conceitos básicos sobre Criar os inimigos. Lembre-se que a primeira opção volta para o sumário principal.","Você quer saber como Criar os inimigos no Construct não é? Aqui você aprenderá como Criar os inimigos para o jogo Arkanoid.","Aqui você aprenderá como Criar os inimigos para seu jogo Arkanoid."],"atividades":["5","14","15"],"textoEsperado":[""],"links":null},{"id":14,"codigo":"5","titulo":"Create object e função random","contexto":["Um vídeo foi aberto sobre o tema Create object e função random.","Eu carreguei um vídeo sobre o tema Create object e função random.","Encontrei um vídeo sobre Create object e função random em meu banco de dados, estou carregando ele para você =D."],"atividades":["13"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaNave\/6.mp4",""]},{"id":15,"codigo":"5","titulo":"Bullet","contexto":["Um vídeo foi aberto sobre o tema Bullet.","Eu carreguei um vídeo sobre o tema Bullet.","Encontrei um vídeo sobre Bullet em meu banco de dados, estou carregando ele para você =D."],"atividades":["13"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaNave\/7.mp4",""]},{"id":16,"codigo":"6","titulo":"Criar sistema de tiro da nave","contexto":["Mais ferramentas do Construct? Aqui você aprenderá os conceitos básicos sobre Criar sistema de tiro da nave. Lembre-se que a primeira opção volta para o sumário principal.","Você quer saber como Criar sistema de tiro da nave no Construct não é? Aqui você aprenderá como Criar sistema de tiro da nave para o jogo Arkanoid.","Aqui você aprenderá como Criar sistema de tiro da nave para seu jogo Arkanoid."],"atividades":["5","17","18","19"],"textoEsperado":[""],"links":null},{"id":17,"codigo":"5","titulo":"Keyboard","contexto":["Um vídeo foi aberto sobre o tema Keyboard.","Eu carreguei um vídeo sobre o tema Keyboard.","Encontrei um vídeo sobre Keyboard em meu banco de dados, estou carregando ele para você =D."],"atividades":["16"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaNave\/8.mp4",""]},{"id":18,"codigo":"5","titulo":"Spawn Another Object","contexto":["Um vídeo foi aberto sobre o tema Spawn Another Object.","Eu carreguei um vídeo sobre o tema Spawn Another Object.","Encontrei um vídeo sobre Spawn Another Object em meu banco de dados, estou carregando ele para você =D."],"atividades":["16"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaNave\/9.mp4",""]},{"id":19,"codigo":"5","titulo":"Bound to Layout, DestroyOutsideLayout e Solid","contexto":["Um vídeo foi aberto sobre o tema Bound to Layout, DestroyOutsideLayout e Solid.","Eu carreguei um vídeo sobre o tema Bound to Layout, DestroyOutsideLayout e Solid.","Encontrei um vídeo sobre Bound to Layout, DestroyOutsideLayout e Solid em meu banco de dados, estou carregando ele para você =D."],"atividades":["16"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaNave\/10.mp4",""]},{"id":20,"codigo":"6","titulo":"Criar sistema de pontuação","contexto":["Mais ferramentas do Construct? Aqui você aprenderá os conceitos básicos sobre Criar sistema de pontuação. Lembre-se que a primeira opção volta para o sumário principal.","Você quer saber como Criar sistema de pontuação no Construct não é? Aqui você aprenderá como Criar sistema de pontuação para o jogo Arkanoid.","Aqui você aprenderá como Criar sistema de pontuação para seu jogo Arkanoid."],"atividades":["5","21","22"],"textoEsperado":[""],"links":null},{"id":21,"codigo":"5","titulo":"Pontuação no jogo","contexto":["Um vídeo foi aberto sobre o tema Pontuação no jogo.","Eu carreguei um vídeo sobre o tema Pontuação no jogo.","Encontrei um vídeo sobre Pontuação no jogo em meu banco de dados, estou carregando ele para você =D."],"atividades":["20"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaNave\/11.mp4",""]},{"id":22,"codigo":"5","titulo":"Colisão entre Objetos","contexto":["Um vídeo foi aberto sobre o tema Colisão entre Objetos.","Eu carreguei um vídeo sobre o tema Colisão entre Objetos.","Encontrei um vídeo sobre Colisão entre Objetos em meu banco de dados, estou carregando ele para você =D."],"atividades":["20"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaNave\/12.mp4",""]},{"id":23,"codigo":"6","titulo":"Criar sistema de derrota e vitória","contexto":["Mais ferramentas do Construct? Aqui você aprenderá os conceitos básicos sobre Criar sistema de derrota e vitória. Lembre-se que a primeira opção volta para o sumário principal.","Você quer saber como Criar sistema de derrota e vitória no Construct não é? Aqui você aprenderá como Criar sistema de derrota e vitória para o jogo Arkanoid.","Aqui você aprenderá como Criar sistema de derrota e vitória para seu jogo Arkanoid."],"atividades":["5","24"],"textoEsperado":[""],"links":null},{"id":24,"codigo":"5","titulo":"Restart Layout","contexto":["Um vídeo foi aberto sobre o tema Restart Layout.","Eu carreguei um vídeo sobre o tema Restart Layout.","Encontrei um vídeo sobre Restart Layout em meu banco de dados, estou carregando ele para você =D."],"atividades":["23"],"textoEsperado":[""],"links":["http:\/\/177.20.148.126\/videos\/AulaNave\/13.mp4",""]}]}